<a href="https://colab.research.google.com/github/akbarmaa/digitalskola_ds11/blob/main/HW_database_Programming.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Database Programming
task : Membuat database dengan menggunakan Pandas
__________________________________________________________

**Muhammad Ali Akbar**

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
path = "/content/drive/MyDrive/File Datascience/saham.txt"

In [ ]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in /usr/local/lib/python3.7/dist-packages (2.7.6.1)

In [ ]:
import psycopg2

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [ ]:
conn = psycopg2. connect( 
    host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
    database = "sandbox",
    user= "ds11_6",
    password = "ds11_6"
)

In [ ]:
cur = conn.cursor()

In [ ]:
sql = "select * from batch_11.cb_stations"
cur.execute(sql)

In [ ]:
cur.fetchone()

(128,
 'MacDougal St & Prince St',
 '5687.04',
 40.727104,
 -74.00297,
 71,
 'CREDITCARD,KEY',
 0,
 False,
 0,
 0,
 0,
 0,
 False,
 False,
 False,
 False,
 datetime.datetime(1970, 1, 1, 0, 0))

In [ ]:
#pandas dataframe
sql = """ select * FROM batch_11.cb_stations"""
data = pd.read_sql_query(sql, conn)
data.head()

   station_id  ... last_reported
0         128  ...    1970-01-01
1         224  ...    1970-01-01
2         229  ...    1970-01-01
3         410  ...    1970-01-01
4         434  ...    1970-01-01

[5 rows x 18 columns]

In [ ]:
#query dari digitalskola
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1584 entries, 0 to 1583
Data columns (total 18 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   station_id                 1584 non-null   int64
 1   name                       1584 non-null   object
 2   short_name                 1584 non-null   object
 3   latitude                   1584 non-null   float64
 4   longitude                  1584 non-null   float64
 5   region_id                  1578 non-null   float64
 6   rental_methods             1584 non-null   object
 7   capacity                   1584 non-null   int64
 8   eightd_has_key_dispenser   1584 non-null   bool
 9   num_bikes_available        1584 non-null   int64
 10  num_bikes_disabled         1584 non-null   int64
 11  num_docks_available        1584 non-null   int64
 12  num_docks_disabled         1584 non-null   int64
 13  is_installed               1584 non-null   bool
 14  is_renting                 1584 non-null   bool
 15  is_returning               1584 non-null   bool
 16  eightd_has_available_keys  1584 non-null   bool
 17  last_reported              1584 non-null   datetime64[ns]
dtypes: bool(5), datetime64[ns](1), float64(3), int64(6), object(3)
memory usage: 168.7+ KB

In [ ]:
#pandas dataframe
sql = """ select * FROM batch_11.cb_trips"""
data10 = pd.read_sql_query(sql, conn)
data10.head()

   tripduration           starttime  ... birth_year  gender
0           547 2013-07-03 18:54:45  ...       1983       1
1           354 2013-07-03 18:55:04  ...          N       0
2           775 2013-07-03 18:55:17  ...          N       0
3          1105 2013-07-03 18:55:29  ...          N       0
4           519 2013-07-03 18:55:30  ...       1971       1

[5 rows x 15 columns]

In [ ]:
data10.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 873416 entries, 0 to 873415
Data columns (total 15 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   tripduration             873416 non-null  int64
 1   starttime                873416 non-null  datetime64[ns]
 2   stoptime                 873416 non-null  datetime64[ns]
 3   start station id         873416 non-null  int64
 4   start_station_name       873416 non-null  object
 5   start_station_latitude   873416 non-null  float64
 6   start_station_longitude  873416 non-null  float64
 7   end_station_id           873416 non-null  int64
 8   end_station_name         873416 non-null  object
 9   end_station_latitude     873416 non-null  float64
 10  end_station_longitude    873416 non-null  float64
 11  bikeid                   873416 non-null  int64
 12  usertype                 873416 non-null  object
 13  birth_year               873416 non-null  object
 14  gender                   873416 non-null  int64
dtypes: datetime64[ns](2), float64(4), int64(5), object(4)
memory usage: 100.0+ MB

In [ ]:
#query dari digitalskola

sql = """WITH t1 AS
              (SELECT b.tripduration, a.name as station_name, b.starttime 
              FROM batch_11.cb_stations as a
              JOIN batch_11.cb_trips as b
              on a.station_id = b.end_station_id
            )

          SELECT station_name, sum(tripduraion) as total_trip_duration
          from T1
          where station_name like '%Clermont%'
          group by 1
          having sum(tripduration) < 3000000
          """
  data2 = pd.read_sql_query(sql, conn)
  data2.head()

IndentationError: ignored

In [ ]:
#diganti start station error 
sql = """
      with
        t1 as
        (
          select
          cs.name,
          ct.tripduration
          from batch_11.cb_trips ct
          join batch_11.cb_stations cs
          on cs.station_id = ct.end_station_id
        )

      select
        t1.name,
        sum(t1.tripduration)
      from t1
      where lower(t1.name) like '%clermont%'
      group by 1
      having sum(t1.tripduration) > 86400
          """
data2 = pd.read_sql_query(sql, conn)
data2.head()

                           name     sum
0  Clermont Ave & Lafayette Ave  760813
1       Clermont Ave & Park Ave  332556
2      Fulton St & Clermont Ave  860286

**Homework**

In [ ]:
#query dari Homework
sql = """
      with
        t1 as
        (
          select
          cs.name,
          cs.region_id
          cs.rental_methods
          ct.tripduration
          from batch_11.cb_trips ct
          join batch_11.cb_stations cs
          on cs.station_id = ct.start station id
        )

      select
        t1.name,
        sum(t1.tripduration)
      from t1
      group by 1
      having sum(t1.tripduration) > 86400
          """
data3 = pd.read_sql_query(sql, conn)
data3.head()